Sysbench-0.5/MDEV-13845/RocksDB-10.3.10/res03/sysbench.rw.50.2.res
sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 2
Report intermediate results every 2 second(s)
Initializing random number generator from seed (42).


Threads started!

[   2s] threads: 2, tps: 322.09, reads: 4523.24, writes: 4517.74, response time: 9.36ms (95%), errors: 0.00, reconnects:  0.00
[   4s] threads: 2, tps: 322.00, reads: 4506.02, writes: 4506.52, response time: 10.15ms (95%), errors: 0.00, reconnects:  0.00
[   6s] threads: 2, tps: 317.50, reads: 4446.96, writes: 4451.96, response time: 10.43ms (95%), errors: 0.00, reconnects:  0.00
[   8s] threads: 2, tps: 332.00, reads: 4648.04, writes: 4648.04, response time: 9.66ms (95%), errors: 0.00, reconnects:  0.00
[  10s] threads: 2, tps: 324.00, reads: 4529.45, writes: 4522.45, response time: 9.61ms (95%), errors: 0.00, reconnects:  0.00
[  12s] threads: 2, tps: 343.00, reads: 4802.06, writes: 4802.06, response time: 9.60ms (95%), errors: 0.00, reconnects:  0.00
[  14s] threads: 2, tps: 327.50, reads: 4591.44, writes: 4592.44, response time: 10.43ms (95%), errors: 0.00, reconnects:  0.00
[  16s] threads: 2, tps: 304.50, reads: 4262.50, writes: 4257.50, response time: 12.11ms (95%), errors: 0.00, reconnects:  0.00
[  18s] threads: 2, tps: 320.50, reads: 4484.52, writes: 4484.52, response time: 9.96ms (95%), errors: 0.00, reconnects:  0.00
[  20s] threads: 2, tps: 340.00, reads: 4762.99, writes: 4767.99, response time: 9.36ms (95%), errors: 0.00, reconnects:  0.00
[  22s] threads: 2, tps: 338.50, reads: 4739.06, writes: 4738.06, response time: 10.16ms (95%), errors: 0.00, reconnects:  0.00
[  24s] threads: 2, tps: 328.00, reads: 4587.50, writes: 4590.00, response time: 9.18ms (95%), errors: 0.00, reconnects:  0.00
[  26s] threads: 2, tps: 315.00, reads: 4408.94, writes: 4406.94, response time: 10.22ms (95%), errors: 0.00, reconnects:  0.00
[  28s] threads: 2, tps: 330.00, reads: 4625.56, writes: 4632.06, response time: 8.59ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 2, tps: 335.50, reads: 4697.03, writes: 4690.53, response time: 9.11ms (95%), errors: 0.00, reconnects:  0.00
[  32s] threads: 2, tps: 326.99, reads: 4569.92, writes: 4570.42, response time: 9.86ms (95%), errors: 0.00, reconnects:  0.00
[  34s] threads: 2, tps: 333.50, reads: 4674.99, writes: 4669.99, response time: 9.84ms (95%), errors: 0.00, reconnects:  0.00
[  36s] threads: 2, tps: 338.01, reads: 4734.08, writes: 4741.08, response time: 9.24ms (95%), errors: 0.00, reconnects:  0.00
[  38s] threads: 2, tps: 337.50, reads: 4723.49, writes: 4721.99, response time: 8.58ms (95%), errors: 0.00, reconnects:  0.00
[  40s] threads: 2, tps: 326.50, reads: 4569.50, writes: 4571.00, response time: 8.74ms (95%), errors: 0.00, reconnects:  0.00
[  42s] threads: 2, tps: 321.00, reads: 4496.95, writes: 4500.95, response time: 9.25ms (95%), errors: 0.00, reconnects:  0.00
[  44s] threads: 2, tps: 332.00, reads: 4648.05, writes: 4644.05, response time: 8.84ms (95%), errors: 0.00, reconnects:  0.00
[  46s] threads: 2, tps: 322.50, reads: 4514.44, writes: 4511.94, response time: 9.95ms (95%), errors: 0.00, reconnects:  0.00
[  48s] threads: 2, tps: 328.00, reads: 4589.50, writes: 4592.00, response time: 9.50ms (95%), errors: 0.00, reconnects:  0.00
[  50s] threads: 2, tps: 334.00, reads: 4672.07, writes: 4670.07, response time: 9.63ms (95%), errors: 0.00, reconnects:  0.00
[  52s] threads: 2, tps: 314.00, reads: 4402.94, writes: 4408.94, response time: 10.29ms (95%), errors: 0.00, reconnects:  0.00
[  54s] threads: 2, tps: 306.00, reads: 4283.99, writes: 4283.99, response time: 11.16ms (95%), errors: 0.00, reconnects:  0.00
[  56s] threads: 2, tps: 307.00, reads: 4297.50, writes: 4291.00, response time: 11.02ms (95%), errors: 0.00, reconnects:  0.00
[  58s] threads: 2, tps: 335.00, reads: 4688.01, writes: 4687.51, response time: 8.63ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 2, tps: 332.50, reads: 4656.50, writes: 4657.50, response time: 9.52ms (95%), errors: 0.00, reconnects:  0.00
[  62s] threads: 2, tps: 316.00, reads: 4425.06, writes: 4425.56, response time: 10.51ms (95%), errors: 0.00, reconnects:  0.00
[  64s] threads: 2, tps: 302.00, reads: 4225.94, writes: 4221.44, response time: 10.75ms (95%), errors: 0.00, reconnects:  0.00
[  66s] threads: 2, tps: 295.50, reads: 4139.03, writes: 4149.03, response time: 11.31ms (95%), errors: 0.00, reconnects:  0.00
[  68s] threads: 2, tps: 304.50, reads: 4262.96, writes: 4258.96, response time: 11.80ms (95%), errors: 0.00, reconnects:  0.00
[  70s] threads: 2, tps: 310.50, reads: 4342.06, writes: 4337.06, response time: 9.75ms (95%), errors: 0.00, reconnects:  0.00
[  72s] threads: 2, tps: 333.00, reads: 4667.02, writes: 4671.02, response time: 8.99ms (95%), errors: 0.00, reconnects:  0.00
[  74s] threads: 2, tps: 334.50, reads: 4680.93, writes: 4673.93, response time: 8.37ms (95%), errors: 0.00, reconnects:  0.00
[  76s] threads: 2, tps: 329.00, reads: 4607.51, writes: 4613.01, response time: 9.49ms (95%), errors: 0.00, reconnects:  0.00
[  78s] threads: 2, tps: 337.50, reads: 4725.50, writes: 4732.00, response time: 9.12ms (95%), errors: 0.00, reconnects:  0.00
[  80s] threads: 2, tps: 332.50, reads: 4654.55, writes: 4648.05, response time: 9.39ms (95%), errors: 0.00, reconnects:  0.00
[  82s] threads: 2, tps: 351.00, reads: 4911.44, writes: 4913.94, response time: 8.94ms (95%), errors: 0.00, reconnects:  0.00
[  84s] threads: 2, tps: 338.01, reads: 4735.07, writes: 4732.07, response time: 8.32ms (95%), errors: 0.00, reconnects:  0.00
[  86s] threads: 2, tps: 346.00, reads: 4842.99, writes: 4843.99, response time: 8.30ms (95%), errors: 0.00, reconnects:  0.00
[  88s] threads: 2, tps: 329.50, reads: 4612.49, writes: 4612.99, response time: 9.09ms (95%), errors: 0.00, reconnects:  0.00
[  90s] threads: 2, tps: 332.50, reads: 4656.44, writes: 4656.44, response time: 9.87ms (95%), errors: 0.00, reconnects:  0.00
[  92s] threads: 2, tps: 317.50, reads: 4445.00, writes: 4446.50, response time: 10.06ms (95%), errors: 0.00, reconnects:  0.00
[  94s] threads: 2, tps: 343.01, reads: 4802.07, writes: 4799.57, response time: 8.29ms (95%), errors: 0.00, reconnects:  0.00
[  96s] threads: 2, tps: 319.50, reads: 4465.44, writes: 4465.44, response time: 9.76ms (95%), errors: 0.00, reconnects:  0.00
[  98s] threads: 2, tps: 347.50, reads: 4871.51, writes: 4872.01, response time: 8.47ms (95%), errors: 0.00, reconnects:  0.00
[ 100s] threads: 2, tps: 321.50, reads: 4501.99, writes: 4500.99, response time: 9.70ms (95%), errors: 0.00, reconnects:  0.00
[ 102s] threads: 2, tps: 334.00, reads: 4674.50, writes: 4676.00, response time: 8.70ms (95%), errors: 0.00, reconnects:  0.00
[ 104s] threads: 2, tps: 322.50, reads: 4516.50, writes: 4522.00, response time: 9.50ms (95%), errors: 0.00, reconnects:  0.00
[ 106s] threads: 2, tps: 346.50, reads: 4843.51, writes: 4837.01, response time: 8.19ms (95%), errors: 0.00, reconnects:  0.00
[ 108s] threads: 2, tps: 326.50, reads: 4578.57, writes: 4583.07, response time: 9.22ms (95%), errors: 0.00, reconnects:  0.00
[ 110s] threads: 2, tps: 334.00, reads: 4675.51, writes: 4671.01, response time: 9.58ms (95%), errors: 0.00, reconnects:  0.00
[ 112s] threads: 2, tps: 323.99, reads: 4534.43, writes: 4535.93, response time: 9.29ms (95%), errors: 0.00, reconnects:  0.00
[ 114s] threads: 2, tps: 319.50, reads: 4474.50, writes: 4472.50, response time: 9.19ms (95%), errors: 0.00, reconnects:  0.00
[ 116s] threads: 2, tps: 322.01, reads: 4501.57, writes: 4502.57, response time: 9.08ms (95%), errors: 0.00, reconnects:  0.00
[ 118s] threads: 2, tps: 317.49, reads: 4449.93, writes: 4450.93, response time: 10.03ms (95%), errors: 0.00, reconnects:  0.00
[ 120s] threads: 2, tps: 338.00, reads: 4733.50, writes: 4732.00, response time: 9.23ms (95%), errors: 0.00, reconnects:  0.00
[ 122s] threads: 2, tps: 351.51, reads: 4920.08, writes: 4915.08, response time: 8.88ms (95%), errors: 0.00, reconnects:  0.00
[ 124s] threads: 2, tps: 332.00, reads: 4649.46, writes: 4660.96, response time: 8.94ms (95%), errors: 0.00, reconnects:  0.00
[ 126s] threads: 2, tps: 348.50, reads: 4878.04, writes: 4871.04, response time: 8.41ms (95%), errors: 0.00, reconnects:  0.00
[ 128s] threads: 2, tps: 317.50, reads: 4445.94, writes: 4445.94, response time: 9.81ms (95%), errors: 0.00, reconnects:  0.00
[ 130s] threads: 2, tps: 346.00, reads: 4842.06, writes: 4844.06, response time: 8.48ms (95%), errors: 0.00, reconnects:  0.00
[ 132s] threads: 2, tps: 338.50, reads: 4740.96, writes: 4733.96, response time: 9.79ms (95%), errors: 0.00, reconnects:  0.00
[ 134s] threads: 2, tps: 313.00, reads: 4378.54, writes: 4387.04, response time: 9.58ms (95%), errors: 0.00, reconnects:  0.00
[ 136s] threads: 2, tps: 332.50, reads: 4656.47, writes: 4654.97, response time: 8.67ms (95%), errors: 0.00, reconnects:  0.00
[ 138s] threads: 2, tps: 330.50, reads: 4629.03, writes: 4627.53, response time: 8.88ms (95%), errors: 0.00, reconnects:  0.00
[ 140s] threads: 2, tps: 329.00, reads: 4606.00, writes: 4605.50, response time: 9.71ms (95%), errors: 0.00, reconnects:  0.00
[ 142s] threads: 2, tps: 329.50, reads: 4612.98, writes: 4619.98, response time: 9.73ms (95%), errors: 0.00, reconnects:  0.00
[ 144s] threads: 2, tps: 349.00, reads: 4886.04, writes: 4886.04, response time: 8.70ms (95%), errors: 0.00, reconnects:  0.00
[ 146s] threads: 2, tps: 315.50, reads: 4416.49, writes: 4409.99, response time: 8.93ms (95%), errors: 0.00, reconnects:  0.00
[ 148s] threads: 2, tps: 346.00, reads: 4843.46, writes: 4842.96, response time: 8.53ms (95%), errors: 0.00, reconnects:  0.00
[ 150s] threads: 2, tps: 317.00, reads: 4431.53, writes: 4432.03, response time: 10.22ms (95%), errors: 0.00, reconnects:  0.00
[ 152s] threads: 2, tps: 347.50, reads: 4866.50, writes: 4865.00, response time: 8.19ms (95%), errors: 0.00, reconnects:  0.00
[ 154s] threads: 2, tps: 314.00, reads: 4395.01, writes: 4397.51, response time: 10.45ms (95%), errors: 0.00, reconnects:  0.00
[ 156s] threads: 2, tps: 361.50, reads: 5063.49, writes: 5061.99, response time: 7.89ms (95%), errors: 0.00, reconnects:  0.00
[ 158s] threads: 2, tps: 322.00, reads: 4509.01, writes: 4512.51, response time: 9.10ms (95%), errors: 0.00, reconnects:  0.00
[ 160s] threads: 2, tps: 331.00, reads: 4636.49, writes: 4628.99, response time: 8.64ms (95%), errors: 0.00, reconnects:  0.00
[ 162s] threads: 2, tps: 336.00, reads: 4704.53, writes: 4709.03, response time: 8.59ms (95%), errors: 0.00, reconnects:  0.00
[ 164s] threads: 2, tps: 326.50, reads: 4570.48, writes: 4569.98, response time: 9.59ms (95%), errors: 0.00, reconnects:  0.00
[ 166s] threads: 2, tps: 333.00, reads: 4656.49, writes: 4662.99, response time: 8.86ms (95%), errors: 0.00, reconnects:  0.00
[ 168s] threads: 2, tps: 319.00, reads: 4470.96, writes: 4465.96, response time: 9.63ms (95%), errors: 0.00, reconnects:  0.00
[ 170s] threads: 2, tps: 331.00, reads: 4633.56, writes: 4634.06, response time: 8.59ms (95%), errors: 0.00, reconnects:  0.00
[ 172s] threads: 2, tps: 337.00, reads: 4714.95, writes: 4712.45, response time: 8.50ms (95%), errors: 0.00, reconnects:  0.00
[ 174s] threads: 2, tps: 332.00, reads: 4643.54, writes: 4646.54, response time: 9.65ms (95%), errors: 0.00, reconnects:  0.00
[ 176s] threads: 2, tps: 331.00, reads: 4643.46, writes: 4640.96, response time: 9.13ms (95%), errors: 0.00, reconnects:  0.00
[ 178s] threads: 2, tps: 298.50, reads: 4178.98, writes: 4179.48, response time: 10.24ms (95%), errors: 0.00, reconnects:  0.00
[ 180s] threads: 2, tps: 342.50, reads: 4795.00, writes: 4796.00, response time: 8.34ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            832692
        write:                           832692
        other:                           118956
        total:                           1784340
    transactions:                        59478  (328.60 per sec.)
    read/write requests:                 1665384 (9200.82 per sec.)
    other operations:                    118956 (657.20 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          181.0038s
    total number of events:              59478
    total time taken by event execution: 361.8759s
    response time:
         min:                                  2.42ms
         avg:                                  6.08ms
         max:                                 34.92ms
         approx.  95 percentile:               9.40ms

Threads fairness:
    events (avg/stddev):           29739.0000/3.00
    execution time (avg/stddev):   180.9379/0.00